#### Terraform Plan for DEV Environment 🚀

<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
[0m[1mdata.google_project.branubrain_fs: Reading...[0m[0m
[0m[1mmodule.firebase.data.google_project.main: Reading...[0m[0m
[0m[1mmodule.cloud_run.google_service_account.cloud_run_sa: Refreshing state... [id=projects/branubrain-fs/serviceAccounts/branubrain-fs-dev@branubrain-fs.iam.gserviceaccount.com][0m
[0m[1mdata.google_client_config.current: Reading...[0m[0m
[0m[1mmodule.cloud_run.google_project_service.cloud_run_apis["containerregistry.googleapis.com"]: Refreshing state... [id=branubrain-fs/containerregistry.googleapis.com][0m
[0m[1mmodule.cloud_run.google_project_service.cloud_run_apis["run.googleapis.com"]: Refreshing state... [id=branubrain-fs/run.googleapis.com][0m
[0m[1mmodule.cloud_run.google_project_service.cloud_run_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=branubrain-fs/artifactregistry.googleapis.com][0m
[0m[1mdata.google_client_config.current: Read complete after 0s [id=projects/"branubrain-fs"/regions/"asia-northeast1"/zones/<null>][0m
[0m[1mdata.google_project.branubrain_fs: Read complete after 0s [id=projects/branubrain-fs][0m
[0m[1mmodule.firebase.data.google_project.main: Read complete after 0s [id=projects/branubrain-fs][0m
[0m[1mmodule.firebase.google_project_service.firebase_apis["firebasehosting.googleapis.com"]: Refreshing state... [id=branubrain-fs/firebasehosting.googleapis.com][0m
[0m[1mmodule.firebase.google_project_service.firebase_apis["firebase.googleapis.com"]: Refreshing state... [id=branubrain-fs/firebase.googleapis.com][0m
[0m[1mmodule.firebase.google_firebase_project.main: Refreshing state... [id=projects/branubrain-fs][0m
[0m[1mmodule.cloud_run.google_artifact_registry_repository.main: Refreshing state... [id=projects/branubrain-fs/locations/asia-northeast1/repositories/branubrain-fs-dev][0m
[0m[1mmodule.cloud_run.google_cloud_run_service.main: Refreshing state... [id=locations/asia-northeast1/namespaces/branubrain-fs/services/branubrain-fs-dev][0m
[0m[1mmodule.firebase.google_firebase_hosting_site.main: Refreshing state... [id=projects/branubrain-fs/sites/branubrain-fs-dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # module.cloud_run.google_cloud_run_service.main[0m will be updated in-place
[0m  [33m~[0m[0m resource "google_cloud_run_service" "main" {
        id                         = "locations/asia-northeast1/namespaces/branubrain-fs/services/branubrain-fs-dev"
        name                       = "branubrain-fs-dev"
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m template {
          [33m~[0m[0m metadata {
              [33m~[0m[0m annotations = {
                  [33m~[0m[0m "autoscaling.knative.dev/maxScale"         = "3" [33m->[0m[0m "10"
                  [31m-[0m[0m "run.googleapis.com/client-name"           = "gcloud" [90m-> null[0m[0m
                  [31m-[0m[0m "run.googleapis.com/client-version"        = "524.0.0" [90m-> null[0m[0m
                  [31m-[0m[0m "run.googleapis.com/startup-cpu-boost"     = "false" [90m-> null[0m[0m
                    [90m# (1 unchanged element hidden)[0m[0m
                }
                [90m# (2 unchanged attributes hidden)[0m[0m
            }
          [33m~[0m[0m spec {
                [90m# (3 unchanged attributes hidden)[0m[0m

              [33m~[0m[0m containers {
                  [33m~[0m[0m image   = "asia-northeast1-docker.pkg.dev/branubrain-fs/branubrain-fs-dev/backend-dev:3565237378c7c5ed8631f4ca77d6ec54fd651e3d" [33m->[0m[0m "asia-northeast1-docker.pkg.dev/branubrain-fs/branubrain-fs-dev/backend-dev"
                    name    = "main-1"
                    [90m# (2 unchanged attributes hidden)[0m[0m

                  [31m-[0m[0m env {
                      [31m-[0m[0m name  = "ENVIRONMENT" [90m-> null[0m[0m
                      [31m-[0m[0m value = "development" [90m-> null[0m[0m
                    }

                  [33m~[0m[0m resources {
                      [33m~[0m[0m limits   = {
                          [33m~[0m[0m "cpu"    = "1" [33m->[0m[0m "2000m"
                          [33m~[0m[0m "memory" = "512Mi" [33m->[0m[0m "1Gi"
                        }
                        [90m# (1 unchanged attribute hidden)[0m[0m
                    }

                    [90m# (2 unchanged blocks hidden)[0m[0m
                }
            }
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.storage.google_storage_bucket.main[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket" "main" {
      [32m+[0m[0m effective_labels            = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
        }
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m labels                      = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
        }
      [32m+[0m[0m location                    = "ASIA-NORTHEAST1"
      [32m+[0m[0m name                        = "branubrain-fs-dev-storage"
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m public_access_prevention    = "enforced"
      [32m+[0m[0m rpo                         = (known after apply)
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m storage_class               = "STANDARD"
      [32m+[0m[0m terraform_labels            = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
        }
      [32m+[0m[0m uniform_bucket_level_access = true
      [32m+[0m[0m url                         = (known after apply)

      [32m+[0m[0m lifecycle_rule {
          [32m+[0m[0m action {
              [32m+[0m[0m type = "Delete"
            }
          [32m+[0m[0m condition {
              [32m+[0m[0m age                   = 30
              [32m+[0m[0m matches_prefix        = []
              [32m+[0m[0m matches_storage_class = []
              [32m+[0m[0m matches_suffix        = []
              [32m+[0m[0m with_state            = (known after apply)
            }
        }

      [32m+[0m[0m versioning {
          [32m+[0m[0m enabled = true
        }
    }

[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Target: `dev` environment | Pusher: @shiroishi761*